# Modified SQL Queries: Flights Database
Â© Explore Data Science Academy

## Instructions to Students

This challenge is designed to determine how much you have learned so far and will test your knowledge on Optimised SQL queries.

The answers for this challenge should be selected on Athena for each corresponding Multiple Choice Question. The questions are included in this notebook and are numbered according to the Athena Questions, the options to choose from for each question has also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good Luck!_**

## Honour Code

I Ridwan, Bankole, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## Loading the database

Before you start producing modify the database, you need to prepare your SQL environment. You can do this by loading in the magic command `%load_ext sql` as we've seen in previous trains. Next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `TMDB.db`sqlite file from Athena and have stored it in a known location.

In [2]:
%load_ext sql

In [3]:
%%sql 

sqlite:///TMDB.db

## Exploring the database 

Before we begin this challenge we can go ahead and take a look at the composition of each table in the TMDB database

In [7]:
%%sql 

SELECT name FROM sqlite_master
WHERE type in ("table", "view")

   sqlite:///flights.db
 * sqlite:///tmdb.db
Done.

[('actors',),
 ('casts',),
 ('genremap',),
 ('genres',),
 ('keywordmap',),
 ('keywords',),
 ('languagemap',),
 ('languages',),
 ('movies',),
 ('oscars',),
 ('productioncompanies',),
 ('productioncompanymap',),
 ('productioncountries',),
 ('productioncountrymap',),
 ('sysdiagrams',)]

## Questions on Modified SQL Queries

**Question 1**

What query would you write to change the name of the language with the 'zh' iso code in the "Languages" table to Chinese?

In [8]:
%%sql

UPDATE languages
SET language_name = "Chinese"
WHERE iso_639_1 = "zh"

   sqlite:///flights.db
 * sqlite:///tmdb.db
1 rows affected.

[]

In [9]:
%%sql
select * from languages
where iso_639_1 = "zh"

   sqlite:///flights.db
 * sqlite:///tmdb.db
Done.

[('zh', 'Chinese')]

**Question 2** 

What query would you write to insert a new genre called Sport with an id of 10?

In [10]:
%%sql 

INSERT INTO genres(genre_id, genre_name)
VALUES (10, "Sport")

   sqlite:///flights.db
 * sqlite:///tmdb.db
1 rows affected.

[]

**Question 3** 

You have just watched The Flintstones movie and did not find it very funny. What code would delete the entry that links The Flintstones to the Comedy genre?

In [9]:
%%sql 

DELETE 
FROM genremap
WHERE movie_id = 888 AND genre_id = 35

 * sqlite:///flights.db

**Question 4**
 
 What query would you write to add a column to the language table that could be used for the English names of the different languages?

In [4]:
%%sql

ALTER TABLE languages 
ADD language_english_name varchar(50)

 * sqlite:///TMDB.db
Done.

[]

**Question 6**

What query would you write to create a new table called Favourites that only has one column for the movie_id?

In [7]:
%%sql

CREATE TABLE Favourites ( movie_id int)

 * sqlite:///TMDB.db
Done.

[]

**Question 7**

When using SQLite, if you want to make sure that you do not put duplicates in your new Favourites table, how would you have created your 'Favourites' table?

In [11]:
%%sql 

CREATE TABLE Favourites (movie_id int unique)

 * sqlite:///TMDB.db
Done.

[]

**Question 8**

When using SQLite, and you want your new 'Favourites' table to also hold the names of your favourite movies. What query would you write to introduce this new column?

In [12]:
%%sql

ALTER TABLE Favourites ADD COLUMN movie_name VARCHAR

 * sqlite:///TMDB.db
Done.

[]